cmsis-svd/cmsis-svd/data/Atmel/ATSAMS70Q21B.svd
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPIDR_ISO_MODE[%s]</name>
               <description>Host Pipe Disable Register</description>
               <alternateRegister>HSTPIPIDR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x620</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINEC</name>
                     <description>Received IN Data Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTEC</name>
                     <description>Transmitted OUT Data Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDERFIEC</name>
                     <description>Underflow Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERREC</name>
                     <description>Pipe Error Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDEC</name>
                     <description>NAKed Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIEC</name>
                     <description>Overflow Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCERREC</name>
                     <description>CRC Error Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIEC</name>
                     <description>Short Packet Interrupt Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKEC</name>
                     <description>Number of Busy Banks Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCONC</name>
                     <description>FIFO Control Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDISHDMAC</name>
                     <description>Pipe Interrupts Disable HDMA Request Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFREEZEC</name>
                     <description>Pipe Freeze Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPIDR_BLK_MODE[%s]</name>
               <description>Host Pipe Disable Register</description>
               <alternateRegister>HSTPIPIDR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x620</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINEC</name>
                     <description>Received IN Data Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTEC</name>
                     <description>Transmitted OUT Data Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXSTPEC</name>
                     <description>Transmitted SETUP Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERREC</name>
                     <description>Pipe Error Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDEC</name>
                     <description>NAKed Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIEC</name>
                     <description>Overflow Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDEC</name>
                     <description>Received STALLed Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIEC</name>
                     <description>Short Packet Interrupt Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKEC</name>
                     <description>Number of Busy Banks Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCONC</name>
                     <description>FIFO Control Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDISHDMAC</name>
                     <description>Pipe Interrupts Disable HDMA Request Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFREEZEC</name>
                     <description>Pipe Freeze Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPIDR_INTRPT_MODE[%s]</name>
               <description>Host Pipe Disable Register</description>
               <alternateRegister>HSTPIPIDR_CTRL_MODE[%s]</alternateRegister>
               <addressOffset>0x620</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXINEC</name>
                     <description>Received IN Data Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXOUTEC</name>
                     <description>Transmitted OUT Data Interrupt Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNDERFIEC</name>
                     <description>Underflow Interrupt Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PERREC</name>
                     <description>Pipe Error Interrupt Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKEDEC</name>
                     <description>NAKed Interrupt Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFIEC</name>
                     <description>Overflow Interrupt Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTALLDEC</name>
                     <description>Received STALLed Interrupt Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKETIEC</name>
                     <description>Short Packet Interrupt Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBUSYBKEC</name>
                     <description>Number of Busy Banks Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOCONC</name>
                     <description>FIFO Control Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PDISHDMAC</name>
                     <description>Pipe Interrupts Disable HDMA Request Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFREEZEC</name>
                     <description>Pipe Freeze Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPINRQ[%s]</name>
               <description>Host Pipe IN Request Register</description>
               <addressOffset>0x650</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>INRQ</name>
                     <description>IN Request Number before Freeze</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>INMODE</name>
                     <description>IN Request Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>HSTPIPERR[%s]</name>
               <description>Host Pipe Error Register</description>
               <addressOffset>0x680</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DATATGL</name>
                     <description>Data Toggle Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DATAPID</name>
                     <description>Data PID Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID</name>
                     <description>Data PID Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Time-Out Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRC16</name>
                     <description>CRC16 Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>COUNTER</name>
                     <description>Error Counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>7</dim>
               <dimIncrement>16</dimIncrement>
               <name>USBHS_HSTDMA[%s]</name>
               <description>Host DMA Channel Next Descriptor Address Register</description>
               <addressOffset>0x710</addressOffset>
               <register>
                  <name>HSTDMANXTDSC</name>
                  <description>Host DMA Channel Next Descriptor Address Register</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NXT_DSC_ADD</name>
                        <description>Next Descriptor Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSTDMAADDRESS</name>
                  <description>Host DMA Channel Address Register</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>BUFF_ADD</name>
                        <description>Buffer Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSTDMACONTROL</name>
                  <description>Host DMA Channel Control Register</description>
                  <addressOffset>0x08</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CHANN_ENB</name>
                        <description>Channel Enable Command</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LDNXT_DSC</name>
                        <description>Load Next Channel Transfer Descriptor Enable Command</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>END_TR_EN</name>
                        <description>End of Transfer Enable Control (OUT transfers only)</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>END_B_EN</name>
                        <description>End of Buffer Enable Control</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>END_TR_IT</name>
                        <description>End of Transfer Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>END_BUFFIT</name>
                        <description>End of Buffer Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DESC_LD_IT</name>
                        <description>Descriptor Loaded Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BURST_LCK</name>
                        <description>Burst Lock Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUFF_LENGTH</name>
                        <description>Buffer Byte Length (Write-only)</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>HSTDMASTATUS</name>
                  <description>Host DMA Channel Status Register</description>
                  <addressOffset>0x0C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CHANN_ENB</name>
                        <description>Channel Enable Status</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CHANN_ACT</name>
                        <description>Channel Active Status</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>END_TR_ST</name>
                        <description>End of Channel Transfer Status</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>END_BF_ST</name>
                        <description>End of Channel Buffer Status</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DESC_LDST</name>
                        <description>Descriptor Loaded Status</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUFF_COUNT</name>
                        <description>Buffer Byte Count</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>CTRL</name>
               <description>General Control Register</description>
               <addressOffset>0x0800</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RDERRE</name>
                     <description>Remote Device Connection Error Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBUSHWC</name>
                     <description>VBUS Hardware Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZCLK</name>
                     <description>Freeze USB Clock</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBE</name>
                     <description>USBHS Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UID</name>
                     <description>UID Pin Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UIMOD</name>
                     <description>USBHS Mode</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UIMODSelect</name>
                        <enumeratedValue>
                           <name>HOST</name>
                           <description>The module is in USB Host mode.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DEVICE</name>
                           <description>The module is in USB Device mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
