cmsis-svd/cmsis-svd/data/Atmel/ATSAMS70Q21B.svd
            <register>
               <name>GSWR</name>
               <description>Global Channel Software Request Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWREQ0</name>
                     <description>XDMAC Channel 0 Software Request Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ1</name>
                     <description>XDMAC Channel 1 Software Request Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ2</name>
                     <description>XDMAC Channel 2 Software Request Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ3</name>
                     <description>XDMAC Channel 3 Software Request Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ4</name>
                     <description>XDMAC Channel 4 Software Request Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ5</name>
                     <description>XDMAC Channel 5 Software Request Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ6</name>
                     <description>XDMAC Channel 6 Software Request Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ7</name>
                     <description>XDMAC Channel 7 Software Request Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ8</name>
                     <description>XDMAC Channel 8 Software Request Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ9</name>
                     <description>XDMAC Channel 9 Software Request Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ10</name>
                     <description>XDMAC Channel 10 Software Request Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ11</name>
                     <description>XDMAC Channel 11 Software Request Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ12</name>
                     <description>XDMAC Channel 12 Software Request Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ13</name>
                     <description>XDMAC Channel 13 Software Request Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ14</name>
                     <description>XDMAC Channel 14 Software Request Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ15</name>
                     <description>XDMAC Channel 15 Software Request Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ16</name>
                     <description>XDMAC Channel 16 Software Request Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ17</name>
                     <description>XDMAC Channel 17 Software Request Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ18</name>
                     <description>XDMAC Channel 18 Software Request Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ19</name>
                     <description>XDMAC Channel 19 Software Request Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ20</name>
                     <description>XDMAC Channel 20 Software Request Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ21</name>
                     <description>XDMAC Channel 21 Software Request Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ22</name>
                     <description>XDMAC Channel 22 Software Request Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWREQ23</name>
                     <description>XDMAC Channel 23 Software Request Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GSWS</name>
               <description>Global Channel Software Request Status Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SWRS0</name>
                     <description>XDMAC Channel 0 Software Request Status Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS1</name>
                     <description>XDMAC Channel 1 Software Request Status Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS2</name>
                     <description>XDMAC Channel 2 Software Request Status Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS3</name>
                     <description>XDMAC Channel 3 Software Request Status Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS4</name>
                     <description>XDMAC Channel 4 Software Request Status Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS5</name>
                     <description>XDMAC Channel 5 Software Request Status Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS6</name>
                     <description>XDMAC Channel 6 Software Request Status Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS7</name>
                     <description>XDMAC Channel 7 Software Request Status Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS8</name>
                     <description>XDMAC Channel 8 Software Request Status Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS9</name>
                     <description>XDMAC Channel 9 Software Request Status Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS10</name>
                     <description>XDMAC Channel 10 Software Request Status Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS11</name>
                     <description>XDMAC Channel 11 Software Request Status Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS12</name>
                     <description>XDMAC Channel 12 Software Request Status Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS13</name>
                     <description>XDMAC Channel 13 Software Request Status Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS14</name>
                     <description>XDMAC Channel 14 Software Request Status Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS15</name>
                     <description>XDMAC Channel 15 Software Request Status Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS16</name>
                     <description>XDMAC Channel 16 Software Request Status Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS17</name>
                     <description>XDMAC Channel 17 Software Request Status Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS18</name>
                     <description>XDMAC Channel 18 Software Request Status Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS19</name>
                     <description>XDMAC Channel 19 Software Request Status Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS20</name>
                     <description>XDMAC Channel 20 Software Request Status Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS21</name>
                     <description>XDMAC Channel 21 Software Request Status Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS22</name>
                     <description>XDMAC Channel 22 Software Request Status Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWRS23</name>
                     <description>XDMAC Channel 23 Software Request Status Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>GSWF</name>
               <description>Global Channel Software Flush Request Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SWF0</name>
                     <description>XDMAC Channel 0 Software Flush Request Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF1</name>
                     <description>XDMAC Channel 1 Software Flush Request Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF2</name>
                     <description>XDMAC Channel 2 Software Flush Request Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF3</name>
                     <description>XDMAC Channel 3 Software Flush Request Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF4</name>
                     <description>XDMAC Channel 4 Software Flush Request Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF5</name>
                     <description>XDMAC Channel 5 Software Flush Request Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF6</name>
                     <description>XDMAC Channel 6 Software Flush Request Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF7</name>
                     <description>XDMAC Channel 7 Software Flush Request Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF8</name>
                     <description>XDMAC Channel 8 Software Flush Request Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF9</name>
                     <description>XDMAC Channel 9 Software Flush Request Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF10</name>
                     <description>XDMAC Channel 10 Software Flush Request Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF11</name>
                     <description>XDMAC Channel 11 Software Flush Request Bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF12</name>
                     <description>XDMAC Channel 12 Software Flush Request Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF13</name>
                     <description>XDMAC Channel 13 Software Flush Request Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF14</name>
                     <description>XDMAC Channel 14 Software Flush Request Bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF15</name>
                     <description>XDMAC Channel 15 Software Flush Request Bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF16</name>
                     <description>XDMAC Channel 16 Software Flush Request Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF17</name>
                     <description>XDMAC Channel 17 Software Flush Request Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF18</name>
                     <description>XDMAC Channel 18 Software Flush Request Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF19</name>
                     <description>XDMAC Channel 19 Software Flush Request Bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF20</name>
                     <description>XDMAC Channel 20 Software Flush Request Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF21</name>
                     <description>XDMAC Channel 21 Software Flush Request Bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF22</name>
                     <description>XDMAC Channel 22 Software Flush Request Bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWF23</name>
                     <description>XDMAC Channel 23 Software Flush Request Bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>24</dim>
               <dimIncrement>64</dimIncrement>
               <name>XDMAC_CHID[%s]</name>
               <description>Channel Interrupt Enable Register</description>
               <addressOffset>0x50</addressOffset>
               <register>
                  <name>CIE</name>
                  <description>Channel Interrupt Enable Register</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>BIE</name>
                        <description>End of Block Interrupt Enable Bit</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LIE</name>
                        <description>End of Linked List Interrupt Enable Bit</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIE</name>
                        <description>End of Disable Interrupt Enable Bit</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIE</name>
                        <description>End of Flush Interrupt Enable Bit</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RBIE</name>
                        <description>Read Bus Error Interrupt Enable Bit</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WBIE</name>
                        <description>Write Bus Error Interrupt Enable Bit</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ROIE</name>
                        <description>Request Overflow Error Interrupt Enable Bit</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
