cmsis-svd/cmsis-svd/data/Atmel/ATSAMS70Q21B.svd
            <register>
               <name>CFSR</name>
               <description>Configurable Fault Status Registers</description>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>IACCVIOL</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>IACCVIOLSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no instruction access violation fault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>the processor attempted an instruction fetch from a location that does not permit execution</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DACCVIOL</name>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DACCVIOLSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no data access violation fault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>the processor attempted a load or store at a location that does not permit the operation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUNSTKERR</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MUNSTKERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no unstacking fault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>unstack for an exception return has caused one or more access violations</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSTKERR</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MSTKERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no stacking fault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>stacking for an exception entry has caused one or more access violations</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MLSPERR</name>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MLSPERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No MemManage fault occurred during floating-point lazy state preservation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>A MemManage fault occurred during floating-point lazy state preservation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MMARVALID</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>MMARVALIDSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>value in MMAR is not a valid fault address</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>MMAR holds a valid fault address</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IBUSERR</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>IBUSERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no instruction bus error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>instruction bus error</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRECISERR</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRECISERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no precise data bus error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>a data bus error has occurred, and the PC value stacked for the exception return points to the instruction that caused the fault</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IMPRECISERR</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>IMPRECISERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no imprecise data bus error</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>a data bus error has occurred, but the return address in the stack frame is not related to the instruction that caused the error</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UNSTKERR</name>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UNSTKERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no unstacking fault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>unstack for an exception return has caused one or more BusFaults</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STKERR</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>STKERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no stacking fault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>stacking for an exception entry has caused one or more BusFaults</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LSPERR</name>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LSPERRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>No bus fault occurred during floating-point lazy state preservation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>A bus fault occurred during floating-point lazy state preservation</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BFARVALID</name>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BFARVALIDSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>value in BFAR is not a valid fault address</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>BFAR holds a valid fault address</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UNDEFINSTR</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UNDEFINSTRSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no undefined instruction UsageFault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>the processor has attempted to execute an undefined instruction</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INVSTATE</name>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>INVSTATESelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no invalid state UsageFault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>the processor has attempted to execute an instruction that makes illegal use of the EPSR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INVPC</name>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>INVPCSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no invalid PC load UsageFault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>the processor has attempted an illegal load of EXC_RETURN to the PC</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOCP</name>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NOCPSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no UsageFault caused by attempting to access a coprocessor</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>the processor has attempted to access a coprocessor</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UNALIGNED</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UNALIGNEDSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no unaligned access fault, or unaligned access trapping not enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>the processor has made an unaligned memory access</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIVBYZERO</name>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIVBYZEROSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no divide by zero fault, or divide by zero trapping not enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>the processor has executed an SDIV or UDIV instruction with a divisor of 0</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HFSR</name>
               <description>HardFault Status register</description>
               <addressOffset>0x0000002c</addressOffset>
               <size>32</size>
               <resetValue>0</resetValue>
               <fields>
                  <field>
                     <name>VECTTBL</name>
                     <description>Indicates when a fault has occurred because of a vector table read error on exception processing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>VECTTBLSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no BusFault on vector table read</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>BusFault on vector table read</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FORCED</name>
                     <description>Indicates that a fault with configurable priority has been escalated to a HardFault exception</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FORCEDSelect</name>
                        <enumeratedValue>
                           <name>VALUE_0</name>
                           <description>no forced HardFault</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VALUE_1</name>
                           <description>forced HardFault</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DEBUGEVT</name>
                     <description>Indicates when a Debug event has occurred</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
